let obj =
    [
        {
            sex: "Мужчин",
            categories: [
                {
                    category: "Пальто и Куртки",
                    subcategories: [
                        {
                            subcategory: "Пуховики и Парки",
                            products: [
                                {
                                    Code: "011352",
                                    Name: "мужчины Зимняя Куртка Длинные Thicker Пальто Руна Теплый Хлопок",
                                    Weight: "1200",
                                    Cost: "3500",
                                    Rating: "4.3"
                                },
                                {
                                    Code: "011870",
                                    Name: "Зимняя куртка с Муёчинны с капюшоном тонкий длинный теплый Куртка Пальто Муёчкая вниз зимой Муёской куртка",
                                    Weight: "1800",
                                    Cost: "2800",
                                    Rating: "3,9"
                                },
                                {
                                    Code: "011424",
                                    Name: "Теплая Верхняя одежда Зима мужчин Parkas Бархат толстые вних пальто с длинный мех воротника жакет с капюшоном",
                                    Weight: "2000",
                                    Cost: "3150",
                                    Rating: "4,3"
                                },
                                {
                                    Code: "011325",
                                    Name: "Камуфляж вниз пальто мужчины Тольстый Зимный боьшой Реальный Мех воротныик Водонепроницаемый ветер",
                                    Weight: "2300",
                                    Cost: "4474",
                                    Rating: "4,8"
                                },
                                {
                                    Code: "011548",
                                    Name: "Мода мужчины зима утка вниз куртка Лыжная пальто снег с капюшоном фугу парка",
                                    Weight: "2840",
                                    Cost: "3199",
                                    Rating: "3,8"
                                },
                                {
                                    Code: "011492",
                                    Name: "Досуг вниз куртка зима толстый капюшон Отдельный Теплый Водонепроницаемый Большой Енот мех -30 градусов",
                                    Weight: "2140",
                                    Cost: "5200",
                                    Rating: "4,9"
                                }
                            ]
                        },
                        {
                            subcategory: "Куртки",
                            products: [
                                {
                                    Code: "012548",
                                    Name: "SCIONE зимняя куртка Тенденция случайных утопленные",
                                    Weight: "1100",
                                    Cost: "2400",
                                    Rating: "3"
                                },
                                {
                                    Code: "012301",
                                    Name: "Весна Осень Бренд США Твердый случайнный Бомбардировщик Куртка",
                                    Weight: "900",
                                    Cost: "1299",
                                    Rating: "4,4"
                                },
                                {
                                    Code: "012140",
                                    Name: "Мужская Молнии куртки тонкий случайнные открытый Бомбардировщик Бейсбол пальто",
                                    Weight: "400",
                                    Cost: "980",
                                    Rating: "3,7"
                                }
                            ]
                        },
                        {
                            subcategory: "Кожанные",
                            products: [
                                {
                                    Code: "013543",
                                    Name: "Мужская PU кожа бизнес Случайный капюшон кожанная куртка",
                                    Weight: "1400",
                                    Cost: "5300",
                                    Rating: "5"
                                },
                                {
                                    Code: "013294",
                                    Name: "Длинные плюс кашемир Мужские промывают кожаная куртка ветровка",
                                    Weight: "2130",
                                    Cost: "7000",
                                    Rating: "4,6"
                                },
                                {
                                    Code: "013287",
                                    Name: "Faux Кожа мужчины мотоцикл байкер Пилот Центр Износа",
                                    Weight: "2600",
                                    Cost: "4800",
                                    Rating: "4,5"
                                }
                            ]
                        },
                        {
                            subcategory: "Пальто",
                            products: [
                                {
                                    Code: "014248",
                                    Name: "Мода Мужская Зимняя Теплая шерсть пальто Двойный грудью пальто Длинные куртка",
                                    Weight: "2150",
                                    Cost: "7299",
                                    Rating: "5"
                                },
                                {
                                    Code: "014170",
                                    Name: "Британский стиль большой размер Мужская зимняя дика мода Slim мульти-цвет шерсть пальто",
                                    Weight: "1866",
                                    Cost: "5200",
                                    Rating: "4,7"
                                }
                            ]
                        }
                    ]
                },
                {
                    category: "Теплая Одежда",
                    subcategories: [
                        {
                            subcategory: "Толстовки и кофты",
                            products: [
                                {
                                    Code: "021254",
                                    Name: "Осенние и зимные мужские Толстовки контраст цвета тонкий утолщенные флис Толстовки",
                                    Weight: "600",
                                    Cost: "864",
                                    Rating: "4"
                                },
                                {
                                    Code: "021854",
                                    Name: "Мода Cool 3D игра трона печать потерять все-матч толстовка балка",
                                    Weight: "650",
                                    Cost: "1483",
                                    Rating: "4,2"
                                }
                            ]
                        },
                        {
                            subcategory: "Пуловеры",
                            products: [
                                {
                                    Code: "022220",
                                    Name: "Мужская мода осень длинный рукав печатных пуловеры толстовки верхней тройник пиджаки блузка",
                                    Weight: "420",
                                    Cost: "1238",
                                    Rating: "4"
                                },
                                {
                                    Code: "022847",
                                    Name: "Модные летные мужчины Т рубашка с длинным рукавом Повседнеыные тонкий Basic вершины тройники",
                                    Weight: "540",
                                    Cost: "886",
                                    Rating: "3,6"
                                }
                            ]
                        },
                        {
                            subcategory: "Мужские кордиганы",
                            products: [
                                {
                                    Code: "023009",
                                    Name: "Модные зимние Men's теплый сгущаться молнию пуловер",
                                    Weight: "520",
                                    Cost: "1350",
                                    Rating: "4,3"
                                },
                                {
                                    Code: "023758",
                                    Name: "Пальто теплой потерять теплое плюшевые кардиган длинный пушистый Топы Блузки",
                                    Weight: "652",
                                    Cost: "534",
                                    Rating: "3,9"
                                },
                                {
                                    Code: "023113",
                                    Name: "Мужчины, сплайсинга сплошной плащ с капюшеном куртка кардиган длинный  рукав куртки и пиджаки блузка",
                                    Weight: "800",
                                    Cost: "1400",
                                    Rating: "5"
                                }
                            ]
                        }
                    ]
                },
                {
                    category: "Аксессуары",
                    subcategories: [
                        {
                            subcategory: "Мужские часы",
                            products: [
                                {
                                    Code: "031077",
                                    Name: "Мужской бизнес Спорт Кварц Смотреть кожаный ремешок",
                                    Weight: "100",
                                    Cost: "90",
                                    Rating: "4,8"
                                },
                                {
                                    Code: "031885",
                                    Name: "Каррен 8314 роскошные Модные кожаные ремешок кварцевые мужчины часы случайные Дата бизнес",
                                    Weight: "100",
                                    Cost: "1195",
                                    Rating: "3,9"
                                }
                            ]
                        },
                        {
                            subcategory: "Головные Уборы",
                            products: [
                                {
                                    Code: "032968",
                                    Name: "Мужчины Hat маска крышка лица маска ветрозащитный крышка мягкая теплая",
                                    Weight: "95",
                                    Cost: "221",
                                    Rating: "5"
                                },
                                {
                                    Code: "032117",
                                    Name: "Мужская бейсбольная купка мфть всесторонную шапку шлифованные загар крышка",
                                    Weight: "100",
                                    Cost: "385",
                                    Rating: "4"
                                }
                            ]
                        },
                        {
                            subcategory: "Ремни и Пояса для Мужчин",
                            products: [
                                {
                                    Code: "033008",
                                    Name: "1 PC моды мужчин автоматические пряжки пояса кажанные ремниталии",
                                    Weight: "500",
                                    Cost: "245",
                                    Rating: "3,9"
                                },
                                {
                                    Code: "033188",
                                    Name: "Новые мужчины высокого качества военного пояса СССР флота холст отечественной джинсы тактического ремня",
                                    Weight: "400",
                                    Cost: "507",
                                    Rating: "5"
                                },
                                {
                                    Code: "033331",
                                    Name: "Случайные Faux Кожа Мужчины Пояс Площади Контактный Бакл Waist",
                                    Weight: "300",
                                    Cost: "271",
                                    Rating: "4"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            sex: "Женщин",
            categories: [
                {
                    category: "Пальто и Куртки",
                    subcategories: [
                        {
                            subcategory: "Пуховики и Парки",
                            products: [
                                {
                                    Code: "111352",
                                    Name: "Женщины Зимняя Куртка Длинные Thicker Пальто Руна Теплый Хлопок",
                                    Weight: "1000",
                                    Cost: "2800",
                                    Rating: "3.3"
                                },
                                {
                                    Code: "111870",
                                    Name: "Зимняя куртка с Муёчинны с капюшоном тонкий длинный теплый Куртка Пальто Муёчкая вниз зимой Муёской куртка",
                                    Weight: "1730",
                                    Cost: "2700",
                                    Rating: "4"
                                },
                                {
                                    Code: "111424",
                                    Name: "Теплая Верхняя одежда Зима Женщин Parkas Бархат толстые вних пальто с длинный мех воротника жакет с капюшоном",
                                    Weight: "2000",
                                    Cost: "3250",
                                    Rating: "5"
                                },
                                {
                                    Code: "111325",
                                    Name: "Камуфляж вниз пальто Женщины Тольстый Зимный боьшой Реальный Мех воротныик Водонепроницаемый ветер",
                                    Weight: "2300",
                                    Cost: "4474",
                                    Rating: "4,8"
                                },
                                {
                                    Code: "111548",
                                    Name: "Мода Женчины зима утка вниз куртка Лыжная пальто снег с капюшоном фугу парка",
                                    Weight: "2840",
                                    Cost: "3199",
                                    Rating: "3,8"
                                },
                                {
                                    Code: "111492",
                                    Name: "Женский Досуг вниз куртка зима толстый капюшон Отдельный Теплый Водонепроницаемый Большой Енот мех -30 градусов",
                                    Weight: "2140",
                                    Cost: "4200",
                                    Rating: "3,9"
                                }
                            ]
                        },
                        {
                            subcategory: "Куртки",
                            products: [
                                {
                                    Code: "112548",
                                    Name: "Женская SCIONE зимняя куртка Тенденция случайных утопленные",
                                    Weight: "1100",
                                    Cost: "2400",
                                    Rating: "4"
                                },
                                {
                                    Code: "112301",
                                    Name: "Весна Женская Осень Бренд США Твердый случайнный Бомбардировщик Куртка",
                                    Weight: "900",
                                    Cost: "1459",
                                    Rating: "4,4"
                                },
                                {
                                    Code: "112140",
                                    Name: "Женская Молнии куртки тонкий случайнные открытый Бомбардировщик Бейсбол пальто",
                                    Weight: "400",
                                    Cost: "880",
                                    Rating: "3,7"
                                }
                            ]
                        },
                        {
                            subcategory: "Кожанные",
                            products: [
                                {
                                    Code: "113543",
                                    Name: "Женская PU кожа бизнес Случайный капюшон кожанная куртка",
                                    Weight: "1400",
                                    Cost: "5300",
                                    Rating: "5"
                                },
                                {
                                    Code: "113294",
                                    Name: "Длинные плюс кашемир Женские промывают кожаная куртка ветровка",
                                    Weight: "2130",
                                    Cost: "7000",
                                    Rating: "4,6"
                                },
                                {
                                    Code: "113287",
                                    Name: "Faux Кожа Женщины мотоцикл байкер Пилот Центр Износа",
                                    Weight: "2600",
                                    Cost: "4800",
                                    Rating: "4,5"
                                }
                            ]
                        },
                        {
                            subcategory: "Пальто",
                            products: [
                                {
                                    Code: "114248",
                                    Name: "Мода Женская Зимняя Теплая шерсть пальто Двойный грудью пальто Длинные куртка",
                                    Weight: "2150",
                                    Cost: "7299",
                                    Rating: "5"
                                },
                                {
                                    Code: "114170",
                                    Name: "Женский Британский стиль большой размер Женская зимняя дика мода Slim мульти-цвет шерсть пальто",
                                    Weight: "1866",
                                    Cost: "5200",
                                    Rating: "4,7"
                                }
                            ]
                        }
                    ]
                },
                {
                    category: "Теплая Одежда",
                    subcategories: [
                        {
                            subcategory: "Толстовки и кофты",
                            products: [
                                {
                                    Code: "121254",
                                    Name: "Осенние и зимные Женские Толстовки контраст цвета тонкий утолщенные флис Толстовки",
                                    Weight: "600",
                                    Cost: "864",
                                    Rating: "4"
                                },
                                {
                                    Code: "121854",
                                    Name: "Женская Мода Cool 3D игра трона печать потерять все-матч толстовка балка",
                                    Weight: "650",
                                    Cost: "1483",
                                    Rating: "4,2"
                                }
                            ]
                        },
                        {
                            subcategory: "Пуловеры",
                            products: [
                                {
                                    Code: "122220",
                                    Name: "Женская мода осень длинный рукав печатных пуловеры толстовки верхней тройник пиджаки блузка",
                                    Weight: "420",
                                    Cost: "1238",
                                    Rating: "4"
                                },
                                {
                                    Code: "122847",
                                    Name: "Модные летные Женщины Т рубашка с длинным рукавом Повседнеыные тонкий Basic вершины тройники",
                                    Weight: "540",
                                    Cost: "886",
                                    Rating: "3,6"
                                }
                            ]
                        },
                        {
                            subcategory: "Женские кордиганы",
                            products: [
                                {
                                    Code: "123009",
                                    Name: "Модные зимние Women's теплый сгущаться молнию пуловер",
                                    Weight: "520",
                                    Cost: "1350",
                                    Rating: "4,3"
                                },
                                {
                                    Code: "123758",
                                    Name: "Пальто теплой потерять теплое плюшевые кардиган длинный пушистый Топы Блузки",
                                    Weight: "652",
                                    Cost: "534",
                                    Rating: "3,9"
                                },
                                {
                                    Code: "1023113",
                                    Name: "Женщины, сплайсинга сплошной плащ с капюшеном куртка кардиган длинный  рукав куртки и пиджаки блузка",
                                    Weight: "800",
                                    Cost: "1400",
                                    Rating: "5"
                                }
                            ]
                        }
                    ]
                },
                {
                    category: "Аксессуары",
                    subcategories: [
                        {
                            subcategory: "Женские часы",
                            products: [
                                {
                                    Code: "131077",
                                    Name: "Женский бизнес Спорт Кварц Смотреть кожаный ремешок",
                                    Weight: "100",
                                    Cost: "90",
                                    Rating: "4,8"
                                },
                                {
                                    Code: "131885",
                                    Name: "Каррен 8314 роскошные Модные кожаные ремешок кварцевые Женщины часы случайные Дата бизнес",
                                    Weight: "100",
                                    Cost: "1195",
                                    Rating: "3,9"
                                }
                            ]
                        },
                        {
                            subcategory: "Головные Уборы",
                            products: [
                                {
                                    Code: "1032968",
                                    Name: "Женщины Hat маска крышка лица маска ветрозащитный крышка мягкая теплая",
                                    Weight: "95",
                                    Cost: "221",
                                    Rating: "5"
                                },
                                {
                                    Code: "132117",
                                    Name: "Женская бейсбольная купка мфть всесторонную шапку шлифованные загар крышка",
                                    Weight: "100",
                                    Cost: "385",
                                    Rating: "4"
                                }
                            ]
                        },
                        {
                            subcategory: "Ремни и Пояса для Женщин",
                            products: [
                                {
                                    Code: "133008",
                                    Name: "1 PC моды Женщин автоматические пряжки пояса кажанные ремниталии",
                                    Weight: "500",
                                    Cost: "245",
                                    Rating: "3,9"
                                },
                                {
                                    Code: "133188",
                                    Name: "Новые Женщины высокого качества военного пояса СССР флота холст отечественной джинсы тактического ремня",
                                    Weight: "400",
                                    Cost: "507",
                                    Rating: "5"
                                },
                                {
                                    Code: "133331",
                                    Name: "Случайные Faux Кожа Женщины Пояс Площади Контактный Бакл Waist",
                                    Weight: "300",
                                    Cost: "271",
                                    Rating: "4"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ];